## Target env: terraform/env
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Apply `failure`

<details><summary>Show Apply</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0d079c6d5e09d8373]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-018f857c875c26a75]
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.eks.aws_iam_policy.alb_controller: Refreshing state... [id=arn:aws:iam::686355260515:policy/AWSLoadBalancerControllerIAMPolicy]
module.eks.data.aws_eks_cluster_auth.cluster_auth: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.cluster_encription_key.aws_kms_key.key: Refreshing state... [id=09e22773-42d1-461c-b6c1-f1433f898a03]
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
module.cluster_encription_key.data.aws_iam_role.github_actions: Reading...
module.eks.data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=ipro-2023-eks-cluster]
module.eks.aws_iam_role.cluster: Refreshing state... [id=ipro-2023-role]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
module.eks.data.aws_iam_policy_document.external_secrets: Reading...
module.eks.data.aws_iam_policy_document.external_secrets: Read complete after 0s [id=2518155820]
module.eks.aws_iam_policy.external_secrets: Refreshing state... [id=arn:aws:iam::686355260515:policy/ipro-2023-eks-external-secrets]
module.cluster_encription_key.data.aws_iam_role.github_actions: Read complete after 0s [id=AllowAccessFromIpro2023]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=ipro-2023-role-20230715092607707100000001]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=ipro-2023-role-20230715092607710600000002]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Refreshing state... [id=09e22773-42d1-461c-b6c1-f1433f898a03]
module.eks.aws_security_group.cluster_shared: Refreshing state... [id=sg-07a871ffc97a4a87a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a9b9055cd6c699f1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-064eb19fe5bb565d0]
module.eks.aws_security_group.control_plane: Refreshing state... [id=sg-07c74cdc68d203ec0]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f3adee7d72d1d6e0]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9754619f854aeca]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-039d947fc15b6d701]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02cb8eaed5065c1c8]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-03d5ae6e537e27bd7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02fdda509f3d78659]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0373288dc9dab2f11]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fea71fec6861f466]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0cf058b6d3ff12642]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e7cd5f20d25d2bc0]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0882abcbade7bf8b8]
module.eks.aws_security_group_rule.inter_node: Refreshing state... [id=sgrule-718084986]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00820358a77174939]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05991199d34dd2fdb]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07903544a9d73b042]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e7cd5f20d25d2bc01080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0da85628b01081a92]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b36050feaf69b5d2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-09535f9da35f0df83]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0365a3db4495142eb]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=ipro-2023-eks-cluster]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02fdda509f3d786591080289494]
module.eks.data.http.cluster_oidc: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Read complete after 0s [id=1722845150]
module.eks.aws_security_group_rule.default_cluster_to_node: Refreshing state... [id=sgrule-419884464]
null_resource.patch-coredns: Refreshing state... [id=7236393287837610487]
module.eks.aws_security_group_rule.node_to_default_cluster: Refreshing state... [id=sgrule-277716966]
module.eks.null_resource.kubeconfig: Refreshing state... [id=6895297005581102792]
module.eks.aws_iam_role.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role]
kubernetes_cluster_role_binding.viewer: Refreshing state... [id=eks-console-dashboard-full-access-binding]
kubernetes_config_map_v1_data.aws_auth: Refreshing state... [id=kube-system/aws-auth]
kubernetes_cluster_role.viewer: Refreshing state... [id=ViewerClusterRole]
module.eks.aws_iam_role_policy_attachment.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role-20230715093402691600000004]
module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr: Refreshing state... [id=ipro-2023-pod-execution-role-20230715093402800600000006]
aws_eks_fargate_profile.kube-system_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-kube-system-fargate-profile]
aws_eks_fargate_profile.app_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-app-fargate-profile]
module.eks.data.http.cluster_oidc: Read complete after 1s [id=https://oidc.eks.ap-northeast-1.amazonaws.com/id/8B149C415713B8444DF66ED54A3A5181/.well-known/openid-configuration]
module.eks.data.tls_certificate.cluster_oidc: Reading...
module.eks.data.tls_certificate.cluster_oidc: Read complete after 1s [id=876ec6096b3f2e9d22b7016d735a7689929468a2]
module.eks.aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::686355260515:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/8B149C415713B8444DF66ED54A3A5181]
module.eks.data.aws_iam_policy_document.oidc_external_secrets: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=3842394126]
module.eks.data.aws_iam_policy_document.alb_controller: Reading...
module.eks.data.aws_iam_policy_document.oidc_external_secrets: Read complete after 0s [id=1356233411]
module.eks.data.aws_iam_policy_document.alb_controller: Read complete after 0s [id=2010462547]
module.eks.aws_iam_role.external_secrets: Refreshing state... [id=ipro-2023-eks-external-secrets-role]
module.eks.aws_iam_role.oidc: Refreshing state... [id=eks-odic-role]
module.eks.aws_iam_role.alb_controller: Refreshing state... [id=ipro-2023-eks-alb-controller-role]
module.eks.aws_iam_role_policy_attachment.alb_controller: Refreshing state... [id=ipro-2023-eks-alb-controller-role-20230715093403948400000009]
module.eks.kubernetes_service_account.aws_loadbalancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.eks.kubernetes_service_account.external_secrets: Refreshing state... [id=kube-system/external-secrets]
module.eks.aws_iam_role_policy_attachment.external_secrets: Refreshing state... [id=ipro-2023-eks-external-secrets-role-20230715093403668300000008]
module.eks.helm_release.aws-load-balancer-controller: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # null_resource.patch-coredns must be replaced
-/+ resource "null_resource" "patch-coredns" {
      ~ id       = "7236393287837610487" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "token"    = (sensitive value)
            # (2 unchanged elements hidden)
        }
    }

  # module.eks.helm_release.external_secrets will be created
  + resource "helm_release" "external_secrets" {
      + atomic                     = false
      + chart                      = "external-secrets/external-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external_secrets"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.external-secrets.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.8.5"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-secrets"
        }
      + set {
          + name  = "webhook.port"
          + value = "9443"
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.
null_resource.patch-coredns: Destroying... [id=7236393287837610487]
null_resource.patch-coredns: Destruction complete after 0s
null_resource.patch-coredns: Creating...
null_resource.patch-coredns: Provisioning with 'local-exec'...
null_resource.patch-coredns (local-exec): (output suppressed due to sensitive value in config)
module.eks.helm_release.external_secrets: Creating...
null_resource.patch-coredns (local-exec): (output suppressed due to sensitive value in config)
null_resource.patch-coredns (local-exec): (output suppressed due to sensitive value in config)
null_resource.patch-coredns: Creation complete after 5s [id=3700955495955968103]
Releasing state lock. This may take a few moments...
```

</details>